
Процедура ОбработкаПроведения(Отказ,Режим)

	// регистр ВКМ_ОтпускаСотрудников
	Движения.ВКМ_ОтпускаСотрудников.Записывать = Истина;
	Для Каждого ТекущаяСтрока из ВКМ_ОтпускаСотрудников Цикл
		
		Движение = Движения.ВКМ_ОтпускаСотрудников.Добавить();
		Движение.Период = Дата;
		Движение.Регистратор = Ссылка;
		Движение.ВКМ_Сотрудник = ТекущаяСтрока.ВКМ_Сотрудник;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		
		Сутки = 60 * 60 * 24;
		ДатаНачалаОтпуска = НачалоДня(ТекущаяСтрока.ВКМ_ДатаНачала);
		ДатаОкончанияОтпуска = НачалоДня(ТекущаяСтрока.ВКМ_ДатаОкончания);
		КоличествоДнейОтпуска = (ДатаОкончанияОтпуска - ДатаНачалаОтпуска) / Сутки + 1;
		
		Движение.ВКМ_КоличествоДнейОтпускаПлан = КоличествоДнейОтпуска;
		
	КонецЦикла;

КонецПроцедуры