
#Область ОбработчикиРегламентныхЗаданий

// Обработчик регламентного задания Уведомление телеграмм.
// Обходит элементы справочника Уведомления, отправляет и после успешной отправки 
// удаляет элементы справочника
//
Процедура ОтправитьВТелеграммНаСервере() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ВКМ_УведомленияТелеграмм);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_УведомленияТелеграмБоту.ВКМ_ТекстСообщения КАК ТекстСообщения,
	|	ВКМ_УведомленияТелеграмБоту.Ссылка
	|ИЗ
	|	Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТекстСообщения = "";
	
	Пока Выборка.Следующий() Цикл
	
		Уведомление = Выборка.Ссылка.ПолучитьОбъект();
		ТекстСообщения = Выборка.ТекстСообщения;
		Результат = ОтправитьВТелеграм(ТекстСообщения);
		
		Если Результат = 200 Тогда
			Уведомление.Удалить();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

Функция ОтправитьВТелеграм(ТекстСообщения) Экспорт

	Токен = Константы.ВКМ_ТокенУправленияТелеграмБотом.Получить();
	ИдентификаторГруппы = Константы.ВКМ_ИдентификаторГруппы.Получить();
	
	СоединениеHTTP = Новый HTTPСоединение("api.telegram.org",443,,,,,Новый ЗащищенноеСоединениеOpenSSL());
	
	Данные = новый структура;
	Данные.Вставить("chat_id", ИдентификаторГруппы);
	Данные.Вставить("text", ТекстСообщения);
	
	ЗаписьJSON = новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Данные);
	СтрокаЗапроса = ЗаписьJSON.Закрыть();
	
	Заголовки   = Новый Соответствие;
	Заголовки.Вставить("content-type", "application/json");
	Запрос = Новый HTTPЗапрос("bot" + Токен + "/sendMessage", Заголовки);
	Запрос.УстановитьТелоИзСтроки(СтрокаЗапроса);
	
	Попытка
		Ответ = СоединениеHTTP.ОтправитьДляОбработки(Запрос);
	Исключение
		Ошибка = Ответ.ПолучитьТелоКакСтроку();
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Отправка данных в Telegram'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,, Ошибка, РежимТранзакцииЗаписиЖурналаРегистрации.Транзакционная);
	КонецПопытки;
	
	Возврат Ответ.КодСостояния;
	
КонецФункции
