
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Строка = ПолучитьИзВременногоХранилища(Параметры.Адрес);
	ЗаголовокДокумента = "График отпусков на " + Строка(Строка.Год) + " год";
   	ПостроитьДиаграммуГанта(Диаграмма, Строка);

КонецПроцедуры

&НаКлиенте
Процедура ОчиститьДиаграмму(Команда)
	ОчиститьДиаграммуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОчиститьДиаграммуНаСервере()
	Диаграмма.Очистить();
КонецПроцедуры


&НаСервере
Процедура ПостроитьДиаграммуГанта(Диаграмма, ДанныеДляЗаполнения)
	
	Диаграмма.Обновление = Ложь;

	Диаграмма.Очистить();
	
	Для Каждого Строка Из ДанныеДляЗаполнения.ТаблицаОтпусков Цикл
	
		Точка = Диаграмма.УстановитьТочку(Строка.ВКМ_Сотрудник);
		
		Серия = Диаграмма.УстановитьСерию("Запланированный отпуск");
		
		Значение = Диаграмма.ПолучитьЗначение(Точка, Серия);
		
        Интервал = Значение.Добавить();
        Интервал.Начало = Строка.ВКМ_ДатаНачала;
        Интервал.Конец = Строка.ВКМ_ДатаОкончания;	
	
	КонецЦикла;
	
	Диаграмма.Обновление = Истина;
	
КонецПроцедуры