
&НаКлиенте
Процедура ВКМ_ОтпускаСотрудниковПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ВКМ_ОтпускаСотрудников.ТекущиеДанные;
	Сутки = 60 * 60 * 24;
	ДатаНачалаОтпуска = НачалоДня(ТекущаяСтрока.ВКМ_ДатаНачала);
	ДатаОкончанияОтпуска = НачалоДня(ТекущаяСтрока.ВКМ_ДатаОкончания);
	КоличествоДнейОтпуска = (ДатаОкончанияОтпуска - ДатаНачалаОтпуска) / Сутки + 1;
	ТекущаяСтрока.КоличествоДнейОтпуска = КоличествоДнейОтпуска;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Сутки = 60 * 60 * 24;
	
	Для Каждого Строка Из Объект.ВКМ_ОтпускаСотрудников Цикл
		
		ДатаНачалаОтпуска = НачалоДня(Строка.ВКМ_ДатаНачала);
		ДатаОкончанияОтпуска = НачалоДня(Строка.ВКМ_ДатаОкончания);
		Строка.КоличествоДнейОтпуска = (ДатаОкончанияОтпуска - ДатаНачалаОтпуска) / Сутки + 1;
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ПоместитьДанныеВоВременноеХранилище()
    
    Структура = Новый Структура();    
    Структура.Вставить("Год", Объект.ВКМ_Год); 
    Структура.Вставить("ТаблицаОтпусков", Объект.ВКМ_ОтпускаСотрудников.Выгрузить());  
    
    Данные = ПоместитьВоВременноеХранилище(Структура, Новый УникальныйИдентификатор);
    
    Возврат Данные;
    
КонецФункции

&НаКлиенте
Процедура АнализГрафика(Команда)
	
	СтрутураПараметров = Новый Структура;
	СтрутураПараметров.Вставить("Адрес", ПоместитьДанныеВоВременноеХранилище()); 
	
	Имя = ПолучитьПолноеИмяФормы("АнализГрафика");
	
	ОткрытьФорму(Имя, СтрутураПараметров, ЭтотОбъект,);
	
КонецПроцедуры

&НаКлиенте 
Функция ПолучитьПолноеИмяФормы(ИмяФормы)
    
    СимволТочка = ".";
    ПозицияТочки = СтрДлина(ЭтаФорма.ИмяФормы);
    
    Пока Сред(ЭтаФорма.ИмяФормы, ПозицияТочки, 1) <> СимволТочка Цикл 
    	ПозицияТочки = ПозицияТочки - 1; 
    КонецЦикла; 
    
    Возврат Лев(ЭтаФорма.ИмяФормы, ПозицияТочки) + ИмяФормы;

КонецФункции


